#language: ru
  Функционал: Озон

    Сценарий: Тест1
      * Нажатие на "Войти"
      * Нажатие на "Войти по почте"
      * Ввести в поле "Почта" значение "stanislav.byckov@mail.ru"
      * Ввести в поле "Пароль" значение "qwerty123456"
      * Нажатие на "Вход"
      * Ввести в поле "Поисковая строка" значение "iphone"
      * Нажатие на "Поиск"

      * Страница 'Результат поиска' загружена
      * Клик на "Закрыть"
      * Цена до "60000"
      * Добавить в корзину товары "чет"
      * Клик на "Корзина"

      * Страница 'Корзина' загружена
      * Проверка наличия продуктов в корзине
      * Проверка итоговой суммы
      * Нажать на "Удалить выбранные"
      * Нажать на "Удалить"
      * Нажать на "Аккаунт"
      * Нажать на "Выйти"

      * Нажать на "Войти"
      * Нажать на "Войти по почте"
      * Заполнить поле "Почта" значением "stanislav.byckov@mail.ru"
      * Заполнить поле "Пароль" значением "qwerty123456"
      * Нажать на "Вход"

      * Проверка пустоты страницы


    Сценарий: Тест2
      * Нажатие на "Войти"
      * Нажатие на "Войти по почте"
      * Ввести в поле "Почта" значение "stanislav.byckov@mail.ru"
      * Ввести в поле "Пароль" значение "qwerty123456"
      * Нажатие на "Вход"
      * Ввести в поле "Поисковая строка" значение "беспроводные наушники"
      * Нажатие на "Поиск"

      * Страница 'Результат поиска' загружена
      * Клик на "Закрыть"
      * Цена до "10000"
      * Клик на "Посмотреть все"
      * Ввод в поле "Бренды" значения "Beats|Samsung"
      * Выбрать бренд "Beats"
      * Выбрать бренд "Samsung"
      * Добавить в корзину товары "нечет"
      * Клик на "Корзина"

      * Страница 'Корзина' загружена
      * Проверка наличия продуктов в корзине
      * Проверка итоговой суммы
      * Нажать на "Удалить выбранные"
      * Нажать на "Удалить"
      * Нажать на "Аккаунт"
      * Нажать на "Выйти"

      * Нажать на "Войти"
      * Нажать на "Войти по почте"
      * Заполнить поле "Почта" значением "stanislav.byckov@mail.ru"
      * Заполнить поле "Пароль" значением "qwerty123456"
      * Нажать на "Вход"

      * Проверка пустоты страницы